УправлениеИТФирмой_First/src/DataProcessors/Задание_2/Задание_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Задание_2</name>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧтоЕст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧтоПьёт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БудетСНочёвкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

УправлениеИТФирмой_First/src/DataProcessors/Задание_2/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Сохранить(Команда)
	
	Приглашение = Объект.Имя + Объект.ЧтоЕст + Объект.ЧтоПьёт + Объект.БудетСНочёвкой;
	
	Если Объект.БудетСНочёвкой = Истина Тогда
		Ночёвка = ("Нужна кровать")
	Иначе                                          
		Ночёвка = ("Кровать не нужна");
	КонецЕсли;
	
	Если ПроверитьЗаполнение() Тогда
		Приглашение = Объект.Имя + Объект.ЧтоЕст + Объект.ЧтоПьёт + Объект.БудетСНочёвкой; 
		Сообщить(СтрШаблон("Придет: %1 Будет есть: %2 Будет пить: %3", Объект.Имя, Объект.ЧтоЕст, Объект.ЧтоПьёт));
		Сообщить(Ночёвка);
	КонецЕсли; 
			
КонецПроцедуры
